{"link":"https://libguides.library.dmu.ac.uk/c.php?g=666908&p=4728605","time_to_take":["20","20","20","20","20"],"steps":["Define a query","Identify necessary measurements requirement to answer query","Collecting data","Summarising and displaying data","Analysing data and interpreting results"],"the_steps":[["After carrying out a literature review formulate research question(s) that support your overall objective. The research question(s) must be clear and concise and should reflect and define what the key purpose of your research is."],["In statistics it is vital to understand what types of data you are working with.<br /><ul><li>Nominal – categories that do not have a natural order (e.g. gender, eye colour, types of building)</li><li>Ordinal – categories which have a natural order but are not numerical (e.g. likert scales of 1 – 5 with 1 being very strongly disagree and 5 being very strongly agree)</li><li>Scale/continuous – numerical data ordered against a constant scale (e.g. temperature, weight)</li><li>Discrete – only take whole numbers (e.g. no. of items brought by a customer in a supermarket)</li></ul>"],["There are two types of data that can be collected; primary or secondary data. Primary data is information which is collected by the researcher itself whereas secondary data is information which has been collected by someone else e.g. government department or organisational records.<br />Depending on the information needed to be gathered to answer the research question(s), an appropriate method of data collection for primary data can be chosen: <ul><li>Experiments</li><li>Surveys</li><li>Observations</li><li>Measurements</li><li>Interviews</li><li>Focus groups</li></ul><br />During this process, other factors such as sampling size and method of sampling should be considered too."],["Before any data analysis is carried out, it is important to get a better understanding of the data set. For descriptive statistics, the data is initially described and summarised using graphs and statistical quantities (e.g. frequencies, percentages, mean, median, bar charts etc.)<br /><br />Ways of describing categorical data:<br /> <ul><li>Median and interquartile range</li><li>Frequency tables</li><li>Bar charts<li>Pie charts</li><li>Percentage frequencies of rows and columns</li><br /><br />Ways of describing continuous data:<br /> <ul><li>Mean and standard deviation</li><li>Histogram</li><li>Boxplots</li><li>Scatter plots</li></ul>"],["Once the descriptive statistics is reported, an analysis of the data set can be carried out. This means clearly understanding your research question and then choosing the right statistical test to analyse your data and draw conclusions from.<br /><br />A statistical hypothesis is an assumption made about a population which may or may not be true. The best way to determine whether a statistical hypothesis is true would be to examine the entire population. Since that is often impractical, we examine a random sample from the population. There are two types of statistical hypotheses:<ul><li>Null hypothesis (H0) The sample observations result purely from chance (i.e. there is no difference)</li><li>Alternative hypothesis (H1) The sample observations are influenced by some non-random cause (i.e. there is a difference)</li></ul><br /><br />By rejecting the null hypothesis it suggests that your assumption about a population is true and that there is a statistical difference between the data sets and this is not due to chance."]]}